[
  {
    "path": "news/2022-01-27-RGovys-Meetup/",
    "title": "RGovys Meetup Jan 27 2022",
    "description": "RGovys Meetup!",
    "author": [
      {
        "name": "Eli Holmes, NOAA",
        "url": {}
      }
    ],
    "date": "2022-01-27",
    "categories": [
      "meeting"
    ],
    "contents": "\nAgenda\nOur first R Govys meetup event is Jan 27, 2022 at 3pm EST.\nPlease register at https://amstat.zoom.us/meeting/register/tZckce-vrzwiGtV6LlbjnrflFIAWX789OhLP or through Meetup at https://www.meetup.com/rgovys/\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2022-02-03-GASP/",
    "title": "GASP 2022 Feb 2-3",
    "description": "Government Advances in Statistical Programming Virtual Meeting 2022. Feb 2-3, 2022. Virtual.",
    "author": [
      {
        "name": "Eli Holmes, NOAA",
        "url": {}
      }
    ],
    "date": "2022-01-27",
    "categories": [
      "conference"
    ],
    "contents": "\nInfo\nGovernment Advances in Statistical Programming conference is Feb 2-3. Here is the schedule and link to register (free). https://nces.ed.gov/fcsm/pdf/Program_Virtual_Workshop.pdf\nSchedule\nFeb 2, 2022 Day 1\nPaper session 1: Machine Learning and Natural Language Processing\nLightning Talks 1: Machine Learning and Automation\nLightning Talks 2: Natural Language Processing\nPaper session 2: Advances in Statistical Modeling\nFeb 3, 2022 Day 2\nWorkshop: Git Started with Version Control with Cecile Murray\nLightning Talks 3: Development to Production\nPanel: Data Science’s Real “Hidden Layer”: IT Environments\nLightning Talks 4: Dashboards and Data Visualization\nPaper session 3: Data Systems, Usability, Reporting\nPresented by the Computational Statistics for the Production of Official Statistics (CSPOS) Interest Group of the Federal Committee on Statistical Methods (FCSM)\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2022-02-15-UseR-2022/",
    "title": "useR! 2022",
    "description": "Update on useR! 2022 meeting. Abstracts due Mar 1",
    "author": [
      {
        "name": "Eli Holmes, NOAA",
        "url": {}
      }
    ],
    "date": "2022-01-21",
    "categories": [
      "conference"
    ],
    "contents": "\nInfo\nHello, all, from the 2022 organizing committee.\nIn light of mid-pandemic restrictions and concerns, we are converting the format of useR! 2022 to an all-virtual conference. Registration will open on March 1, at the conference website.\nWe continue to welcome proposals for tutorials, talks, panels, and poster/elevator pitch presentations. Submissions must be in English but we encourage plans to teach in Spanish or French. See https://user2022.r-project.org/participate/call-for-tutorials/ for tutorials and https://user2022.r-project.org/participate/call-for-abstracts/ for abstracts.\nThe new due dates for submissions are February 15 for tutorials and March 1 for abstracts/talks. We’re very much looking forward to considering your ideas (especially if you can get them to us sooner than later!).\nWe’ll be sharing news soon about more keynotes and fresh opportunities, so stay tuned!\nuseR! 2022 Organizing Team https://user2022.r-project.org/\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2021-10-12-nmfs-r-users/",
    "title": "NMFS R Users Meetings",
    "description": "NMFS R Users Group",
    "author": [
      {
        "name": "Emily Markowitz",
        "url": "https://emilyhmarkowitz.github.io/emilyhmarkowitz/"
      }
    ],
    "date": "2021-10-12",
    "categories": [
      "nmfs-r-users",
      "rmarkdown"
    ],
    "contents": "\nJoin the NMFS R Users Group\nWe have monthly meetings on topics of interests to R users in our agency. Info and upcoming events here: https://nmfs-openscapes.github.io/NMFS-R-UG/\nSign up for our email list: Make sure you are logged into your NOAA Google account in your browser. Then click sign-up for NMFS R UG to see the event and add to your calendar.\nOct 2021 Inaugural meeting of the NMFS R Users Group!\nAgenda for the October 12, 2021 Meeting: Getting organized and a short cool topic presentation.\nWhat do we want this R Users group to do? Suggestions:\nAll things R across all of NOAA Fisheries\n15 minute talks on cool topics\nTutorial sharing\nLightning talks\nDiscussions on best practices\n\nReading group\nTidy Tuesday challenges\nBreakout groups/brainstorming/hack-a-thons for developing better workflows/products\n\nTopics we would like to see discussed this quarter. Examples:\n{Targets} - Tutorial\n{NMFSReports} - can we work on something like this together to help standardize our annual report writing processes across NMFS?\nLightning talks about how we write reports with R Markdown. Pros and Cons? Presentation + Discussion\n{testthat} - Tutorial\n{googledrive} - Tutorial\nWhat should be shared on GitHub - discussion about best practices and caveats\n\nHow often we would like to meet.\nHow to see the meeting info\nInstructions to see the virtual meeting link and shared documents.\nMake sure you are logged into your NOAA Google account in your browser. Then click the calendar event to see the event and add to your calendar.\nAlternative instructions:\nGo to the Events tab. In the top right, you’ll see a little arrow. Click that and make sure you can see the NMFS R Users calendar. If you can, then click on the event on Oct 12th, 2021 and click on ‘show details’ in the event pop-up. I can’t see the NMFS R Users calendar. You need to be logged into your NOAA Google account in your browser. I don’t have a NOAA email NMFS = National Marine Fisheries Service. This is a NOAA Fisheries R User group. You can join the Inter-Agency R Users Group if you are in a different US federal agency.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2021-10-14-nasa-open-data/",
    "title": "NASA Open Data Workshop Oct 14th",
    "description": "Open Source Science for Data Processing and Archives Workshop",
    "author": [
      {
        "name": "Eli Holmes",
        "url": "https://github.com/eeholmes"
      }
    ],
    "date": "2021-10-01",
    "categories": [
      "workshop",
      "NASA",
      "big data"
    ],
    "contents": "\nOpen Source Science for Data Processing and Archives Workshop\nOn October 14, 2021 from 12:00pm - 3:00pm ET, NASA will be holding a virtual workshop on the Open Source Science Initiative which is part of NASA’s Strategy for Data Management and Computing for Groundbreaking Science 2019-2024. The workshop will also introduce NASA’s Transform to Open Science (TOPS) initiative to help jump start the adoption of open science across NASA’s data communities. See the announcement for full details. Open to the public.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2021-07-21/",
    "title": "IA R UG Meeting July 12, 2021",
    "description": "Meeting Notes from July 12, 2021",
    "author": [
      {
        "name": "Wendy Martinez",
        "url": {}
      }
    ],
    "date": "2021-07-21",
    "categories": [
      "inter-agency r-users",
      "meeting"
    ],
    "contents": "\nAgenda\n7/12/2021\nOMB meeting update-\nWendy and others are working on proposing an overarching policy to OMB for all policies to utilize open source analytical software\nSet up a meeting with the Chief Information Officer to discuss logistics FDA is spending too much on analytical software, is attempting to propose open source software as the solution http://opengovhub.org/home\nScott/Census- Use agencies existing statements about innovation and discuss how innovation in statistics can’t exclude open source. Also, many federal agencies list employee recruiting and retention as primary goals. Excluding open source is going to make recruiting more challenging. Opened up conversation regarding hiring recent graduates who are exclusively learning R and Python but excluding those software’s in job responsibilities, will affect recruitment and retention Would ideally also like to pay for expanded support for R Wendy, Tomas and Peter will follow up on this effort\nTwo events coming up:\nEPA (Anne)- Discussion on open source and possible collaboration with agencies on using open source software. Event is July 23rd\nBLS R Users Group: July 29th, Noon, talk on time series data in R\n\nBLS Membership with R Consortium\nThis is in progress Can join for free, but to gain consortium benefits the cost is ten thousand R Consortium and Python Foundation Anaconda- includes RStudio\nAgency updates\nCensus: The Census Bureau R Users Group is growing and expanding its userbase and presentation materials\nEPA: Bi-annual workshop is coming up. 21st is open to all, but the 22-23 workshops is mostly limited to EPA\nFDA: Intro to shiny workshop and other workshops\nNAS (??): Machine learning project is in the works\n\nMeeting notes\nWe had about 20 attendees – which is fantastic! Here is an agenda for our meeting today. WebEx information is below.\nUpdate on meeting with OMB\nSummary document/email was attached to the meeting invite.\nPeter Meyer (BLS) can talk about Open Source Software (OSS), but has to leave early. Wendy asked for thoughts on what should be the next step after the meeting with OMB. Set up meeting with CIO of the US? Tomas (FDA) said we should have an entity to shepherd this. FDA said they are paying too much. Tomas said that could be an opening to justify it. Paul said he had gotten pushback on his advocating for R. Peter said we could get data on what – Joe Castle (?) at GSA – is doing. Peter could connect us with him. This relates to the policy published 6 years ago and was mentioned in the OMB meeting summary. There was a project called code.gov. Is there something called open.gov? Tomas will do some checking, but doesn’t know the entity exactly. It’s a private company. FU: Wendy, Tomas, and Peter. And, Scott of course.\nGeorge: New data scientists and statisticians being trained use Python and R. Hard to retain the employees if we do not give them the tools. What are the implications to HR and procurement if open source used?\nTomas reviews grants for NIH. A lot of the bio-stats and bio-informatics study sections get points off if don’t have open-source application.\nCensus R UGs have consolidated and have approximately 250 users. Yves made the point that OSS is not really free because some support is needed from staff. Census would rather keep the money (support) for commercial.\nUpcoming events for R Users\nWendy sent invitations to get them on calendars. Feel free to forward to others.\nJuly 23: Organized by Ann – EPA: Vince Allen is Chief Architect. He has fully embraced open-source at EPA. He will provide an overview on open-source. An opportunity to have a meeting of Chief Architects across federal agencies. So, maybe agencies would adopt and be open like EPA. Maybe organize a meeting Chief Architects. George said could we get some statements – DOT IG got approval to use R. Could we get some documents? New CIOs and the Chief Data Officers could also be the intended audience. FU: Organize this event and maybe work with CSPOS to organize workshop.\nJuly 29 – BLS R UG @ noon. R and Time Series.\nMemberships with R Consortium\nWendy will meet with Joe of R Consortium about BLS becoming a member. She will give a summary of the meeting. She said that the American Statistical Association is also becoming a member.\nR Consortium and Python Foundation (Nathan)\nVersioning of it is an issue. USDA and NASS – there is willingness to support R and Python. Not a lot of clarity on how to do that well. Enthusiasm at NASS about Anaconda distribution of Python because Python has updated its terms of service for a commercial entity using the Anaconda and paying a nominal fee. Gives them something to buy into. Maybe, an update schedule or maintenance of repositories. He had a thought – Anaconda distribution allows access to R packages as well. Although, it seems to be a much smaller number of packages, and might not have the ones they need (e.g., Bayesian ones). There seems to be some willingness, but there does not seem to be consensus on how to do it. FU: Check on this with R Consortium\nHave other agencies had these discussions? MS R Open used?\nNathan would like to bring IT staff involved in these conversations. CSPOS wants to bring these up. Nathan will ask CSPOS Matt if they can/should look into this.\nAgency updates and issues\nBLS: Wendy gave an update on what the R Governing Board is up to. She knows that some (George) asked for copies of the documents, but she is waiting until they are in better shape. The GB is still working on the process and how they are going to set up the official version of R.\nBLS Data Science Curriculum: Wendy mentioned the DS Curriculum, which is a semester long training that includes courses and a capstone project. FU: Wendy will ask Brandon Kopp to give a talk on it.\nAnn: Preparing for EPA bi-annual R Workshop. This year will be virtual from Sep 21 – 23 in the PM. She will share registration, but might have to watch some numbers with certain sessions. Workshops: Intro to R, four advanced and intermediate classes. The plenary on 21st will likely be open to all. Plenary is Jenny Bryant of R Studio. They will also have talks from what folks are doing in R.\nCensus: Bureau R UG – anyone can join. Jessica Klein is new Chair of the group of about 250 members. They are hiring a lot of new data scientists.\nFDA: Tomas did an Intro to Shiny workshop that went well. Several ongoing initiatives. FDA receives R programs from sponsors that document their analyses that go into submission packages (devices, etc.). They are working with R Consortium to enable a demonstration project that shows how sponsors can submit programs and proprietary code. Paul echoes concerns that others raised. Finds more and more of incoming staff have experience with R as opposed to other statistical software.\nNASS: They have a small machine learning IG – teaching, bring people with shared interest. Might have comments in response fields – looking for useful information using ML approaches. They have a text analysis project in the works.\nFrom the Chat:\nfrom Peter M to everyone: 1:12 PM http://opengovhub.org/home\nfrom Scott A to everyone: 1:17 PM Perhaps an avenue to be explored may be to use agencies existing statements about innovation and discuss how innovation in statistics can’t exclude open source. Also, many federal agencies list employee recruiting and retention as primary goals. Excluding open source is going to make recruiting more challenging.\nfrom Peter M to everyone: 1:18 PM YES.\nfrom Grace E to everyone: 1:20 PM I am currently in my Masters program for Applied Statistics, and we are only using R. In maybe 1 class we will use SAS\nfrom Ann A to everyone: 1:20 PM R is super standard in most academic fields now, from math to social sciences. Even when academics have experience in SPSS or SAS, it’s supplemental to R or, for example: how common is it to have R users come in and have to learn SAS? are agencies ready to upskill R users to SAS? That’s an additional onboarding expense The R community is very self-policing, especially since so much of it is used for academia and public benefit\nfrom Scott A to everyone: 1:30 PM Agree 100% with Ann\nfrom Ann V to everyone: 1:31 PM Our security staff tests OSS for security vulnerabilities. There’s a process for obtaining freeware/shareware which involves this as part of that process.\nfrom Andrew Y to everyone: 1:32 PM CMS/CCSQ is using Zeppelin on top of Hive\nfrom Ann V to everyone: 1:32 PM python has more vulnerabilities than R - so they keep a little tighter control on python installations than R. We have R, Rstudio and Rtools installed via something called “big fix” - not sure if other agencies have that, but we could share the script if useful.\nfrom Nathan C to everyone: 1:34 PM Ann, could you forward any more information on that to me?\nfrom Ann V to everyone: 1:34 PM Nathan - the big fix script?\nfrom Nathan C to everyone: 1:34 PM Yes, or any detail about supporting that bundle well on EPAs end.\nfrom Ann V to everyone: 1:35 PM yes - will do\nfrom Sunita Y to everyone: 1:42 PM Hi Nathan, I am at USDA and I still do not have R installed properly. I’ll reach out via email if you have tips on how to install R at USDA.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/03-24-2021-nasa-openscapes-announcement/",
    "title": "NASA Announces 3-year Openscapes cohorts",
    "description": "Mar 2021, NASA announced a 3-year Openscapes program to support training in in the tools for modern data science using open science workflows. The training program has a heavy emphasis on R and Python, which are mainstays of open science computing and statistical analysis.",
    "author": [
      {
        "name": "Eli Holmes",
        "url": {}
      }
    ],
    "date": "2021-03-24",
    "categories": [
      "remote-sensing",
      "training"
    ],
    "contents": "\nNASA announced a 3-year Openscapes program to support training in in the tools for modern data science using open science workflows within the Earth Observing System Data and Information System (EOSDIS) Distributed Active Archive Centers (DAACs). “Researchers are often tasked with analyzing large datasets, but they rarely have formal training in coding, data wrangling, and collaborative research practices. Compounding these challenges is the need to migrate data analyses to the cloud as remote sensing instruments provide higher resolution data.” The training has a heavy emphasis on R and Python, which are mainstays of open science computing and statistical analysis.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  },
  {
    "path": "news/2020-09-14/",
    "title": "IA R UG Meeting Notes Sept 14, 2020",
    "description": "Meeting Notes from Sept 2020 Meeting",
    "author": [
      {
        "name": "Wendy Martinez",
        "url": {}
      }
    ],
    "date": "2020-09-14",
    "categories": [
      "inter-agency r-users",
      "meeting"
    ],
    "contents": "\nMeeting notes\n  COVID-19 Workshop (recap) and GASP!\nData Science Conference on COVID – Mike Jadoo – 210 people showed up. RSVP count was 871, so people came in and out. Recordings are on the website. Mike will send a link to the recordings and slides when it is available.\nGASP! – Nathan – FCSM CSPOS co-organized Government Advances in Statistical Programming workshop – Nov 6. October 15 abstracts are due. Wendy sent links already. Send questions to Nathan or Mike – GIVE EMAILS. George tried to register but had to do it again. Workshop website\n  Big Data For Social Science – Sep 30 – Oct 2 – [Website](https://nsf.gov/events/event_summ.jsp?cntn_id=301101)\n\n  R Consortium Working Group proposal: Wendy will set up a meeting. Tomas, Nathan (CSPOS). Tomas spoke with the lead of the R Validation Hub. He was happy to help lead us through the admin part of it. Reach out to him and schedule a chat with him. Andy Nichols. We have a better idea of what we want to do. Maybe make a list of what we want to do and then get Andy’s help. Tomas will take this as an action item to set up a call or meeting. Wendy will send email reminder to Tomas.\n  Installation of Rtools40 on Windows – George – the tools also requires a modification to the underlying files reference. If anyone has trouble with the information on CRAN – setting up environment files/settings. `.Renviron` file. He was able to resolve it. Ann thinks it was fixed with R 4.0.2. Ann sent an email to the group with some helpful information.\n  Next meeting via WebEx? Wendy will send a WebEx meeting for the next meeting.\n  Agency updates:\nTomas – FDA: He is running a modeling and simulation work group at FDA. He developed an initiative called MS office hours. Develop a grass roots teaching initiative. If you do something in your daily routine you think is valuable, then set up a WebEx and teach it – a little snippet. Most successful one was a baby intro to R. Very basic stuff. Get people over the first barrier to using R. Just one hour. No preparation because it’s so basic. Would the group like to do it? It could be our group effort. Ann likes this idea too. They have a basic intro class too taking place on Nov 18. Makes sense to do it as a broader group. Offer on a quarterly basis. Tomas, Mike, and Wendy can coordinate. Effort would be on how to advertise. Ann said some can attend hers and/or she can tell us how it went. Ann sent an email about this opportunity.\nCOVID re-opening at FDA – do a vignette or talk on the project. HHS is producing numbers for white house directive on re-opening phases. Agencies take the data and use it to determine whether to re-open. They have a piece of R code that runs the data. Tomas can give a talk. Wendy will organize a presentation.\nAnn – EPA – Nothing significant to report.\nMike – BLS – Had a long series of workshops showing R in different settings – R for webscraping, using R to create PPT, DS toolbox using R.\nIDEA: Wendy set up a YouTube channel. Have a series of very short snippets showing how to do something. But, would have to do it in the wild; i.e., no official logos. Keep this idea for the future. Need to think about it more.\nNathan – NASS – Upcoming conference opportunities – free – BigSurv20 (virtual and free, https://www.bigsurv20.org/ ) registration not up yet. He is using Bayesian models in R for county crop estimates. Open access paper using Bayesian models in R. An email from Nathan with the paper is attached.\nGeorge – DOT – he was able to improve aspects of things in R Markdown. He would be interested in discussing R Markdown more. Is this a topic for further discussion? Maybe a future agenda item. Areas of expertise we might want to develop. R Markdown and apply it to production (official statistics). Mike Jadoo is exploring this now. He has something ready to share. This might be good for a separate meeting. George is happy to contribute. Wendy will send separate email to follow-up.\nChuck – Census – In process of organizing an R Users Affinity Group, which will give them more influence at Census. Attempts to get support failed. Proposals were considered and rejected.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-01-27T21:10:01+00:00",
    "input_file": {}
  }
]
